import os
import sys
import re

BOOK_PATH = 'book/book.txt'
PAGE_SIZE = 1050

book: dict[int, str] = {}

# Функция, возвращающая строку с текстом страницы и ее размер
text1 = 'Раз. Два. Три. Четыре. Пять. Прием!'
text2 = '''Да? Вы точно уверены? Может быть, вам это показалось?.. Ну, хорошо, приходите завтра, тогда и посмотрим, что можно сделать. И никаких возражений! Завтра, значит, завтра!'''
text3 = '— Я всё очень тщательно проверил, — сказал компьютер, — и со всей определённостью заявляю, что это и есть ответ. Мне кажется, если уж быть с вами абсолютно честным, то всё дело в том, что вы сами не знали, в чём вопрос.'
text4 = 'Да? Вы точно уверены? Может быть, вам это показалось?.. Ну, хорошо, приходите завтра, тогда и посмотрим, что можно сделать. И никаких возражений! Завтра, значит, завтра!'


# Функция, возвращающая строку с текстом страницы и ее размер
def _get_part_text(text: str, start: int, size: int) -> tuple[str, int]:
    text_page = text[start:start+size]
    text_test = text[start:start+size+1]


    text_page_lst = re.split(r'(\s+)', text_page) # чтобы сохранить все пробелы
    text_test_lst = re.split(r'(\s+)', text_test)

    word_page = text_page_lst[-1]
    if word_page[-1] in ',.!:;?' and word_page[-2] not in ',.!:;?':
        word_test = text_test_lst[-1]
        if word_test[-1] in ',.!:;?' and word_test[-2] not in ',.!:;?':
            text_page_result = text_page
        elif word_test[-1] in ',.!:;?' and word_test[-2] in ',.!:;?':
            text_page_result = ''.join(text_page_lst[:-1])
    if word_page[-1] in ',.!:;?' and word_page[-2] in ',.!:;?':
        text_page_result = ''.join(text_page_lst[:-1])
    if word_page[-1] not in ',.!:;?' and word_page[-2] not in ',.!:;?':
        text_page_result = ''.join(text_page_lst[:-1])

    for i in range(len(text_page_result))[::-1]:
        if text_page_result[i] in ',.!:;?':
            return text_page_result[:i+1], len(text_page_result[:i+1])



# print(*_get_part_text(text1, 5, 9), sep='\n')
# print(*_get_part_text(text2, 22, 145), sep='\n')
# print(*_get_part_text(text3, 54, 70), sep='\n')
# print(*_get_part_text(text4, 0, 54), sep='\n')

text5 = '''РЭЙ БРЕДБЕРИ ПРЕДОСТЕРЕГАЕТ
   Имя Рэя Бредбери прочно вошло в обиход советских читателей. Ему не пришлось добиваться их признания: первая же его книга «451° по Фаренгейту», переведенная на русский язык, получила в нашей стране широкую известность. Со времени ее первого появления на книжных полках наших магазинов и библиотек прошло уже около 10 лет. Совсем недавно вышло второе издание этой примечательной повести. За эти годы имя Рэя Бредбери множество раз встречалось нашим читателям на страницах периодической печати и многих сборников.
   Широкая известность автора предлагаемой читателям книги «Марсианские хроники» несколько упрощает задачу предисловия: нет нужды заново представлять автора читателям - открывая книгу, многие из них как бы вновь встречаются со старым знакомым.
   Это обстоятельство в свою очередь дает возможность глубже вникнуть в сущность его книги и привлечь внимание читателей к тому, как Бредбери рассматривает роль литературы в обществе. Ведь Рэй Бредбери относится к тому разряду художников, которые все свое творчество, все свое умение обращают на благо Человека, на его сегодня, а главное на его завтра. Внимательный глаз художника остро улавливает и в окружающем человека мире и внутри его самого те силы, которые внушают тревогу за его будущее. Почти в каждой книге Рэя Бредбери, почти в каждой новелле звучит тревожный сигнал бедствия. Писатель видит свою роль в том, чтобы - пока не поздно - предупредить людей, населяющих Землю, о нависшей над ними опасности, заставить их по мере сил противодействовать акциям, которые неотвратимо привели бы их к гибели нравственной, а чаще всего - и физической.
   Отсюда достигающий порой огромной силы мрачный колорит многих произведений Рэя Бредбери. Некоторые критики утверждают, что Бредбери-художник очень пессимистичен. Такое суждение крайне поверхностно. Силой своего таланта Рэй Бредбери умеет с большой выразительностью сказать то, к чему постоянно и настойчиво возвращается мысль многих наших современников, и в первую очередь соотечественников Бредбери. Весьма своеобразно- по ходу мысли, по форме ее выражения - он предостерегает человечество середины XX века от безумия атомной войны и вместе с тем от всепожирающей погони за наживой во имя мертвечины механизированного комфорта: ради него люди в своем безрассудстве готовы жертвовать человечностью, теплом человеческой любви, богатствами человеческого интеллекта, сокровищами мировой культуры.
   По свидетельствам американской печати, Рэй Бредбери лично с предубеждением относится к изобретениям новейшей техники даже в быту. Во всяком случае, смысл и счастье жизни он видит совсем в ином. Издавна в американской литературе нет-нет да прозвучит тревога за то, что ждет людей в недалеком будущем в случае, если, подчинив свои усилия стремлению к замене самих себя машинами, они забудут при этом обо всем бесценном и неповторимом, что отличает Человека от машины, даже самой хитроумной по конструкции и по выполняемым ею функциям.
   Но вряд ли кто-либо другой в истории фантастической литературы США был наделен такой же силой убежденности, тем многообразием художественных средств, какими так легко, так умело пользуется Рэй Бредбери.
   Доводилось встречать в печати и утверждения, что именно личная неприязнь Бредбери к машинам, к технике движет его писательским пером. Вряд ли можно согласиться и с этим. Бредбери трезв в своих наблюдениях над историей человечества, в своем анализе поведения человека. Развитие технической мысли, совершенствование машин и распространение их как бы выносится писателем за скобки, настолько это представляется ему бесспорным, само собой разумеющимся. Просто он не следует проторенным другими писателями-фантастами путем заглядывания в инженерные кальки будущего. Это - дело людей науки, людей техники. Свою миссию писателя Рэй Бредбери видит совсем в ином.
   Психолог, душевед, аналитик человеческого разума и поведения, как бы говорит всем Своим творчеством Бредбери, писатель дол-жен подсматривать и показывать другим, тем, кому не дано такой способности, те черты Человека, которые рождаются вновь или видоизменяются с развитием цивилизации. Призвать своих современников к бережному обращению со всеми несметными богатствами, созданными разумом человека, убедить их в том, что, лишив себя этих богатств, они утратят счастье жизни, раскрыть им глаза на уродливые стороны поступков, продиктованных слепым стремлением к материальному комфорту,- в этом видит художник Бредбери главную задачу искусства в сегодняшнем мире.
   И эту задачу, актуальную в первую очередь для современной Америки, он выполняет с присущим ему мастерством. Все его творчество- пример счастливого сочетания интеллектуальной убежденности и большого мастерства художника.
   Всякому, кто прочел повесть «451° по Фаренгейту», надолго запомнились великолепные образы пожарника Монтэга, взбунтовавшегося против похода на создание человеческого интеллекта, и обаятельной в своей поэтичности девушки Клариссы, и удивительная концовка повести, где ее герой внезапно для себя перво-открывает огонь, пламя костра как нечто согревающее и притягательное. Для него, человека, приученного к огню только как к средству истребления, это подлинное открытие. С огромной силой звучит в этой повести твердая, неискоренимая вера в победу человеческого разума над мощными, но злыми силами разрушения. Совершенна в своей законченности и сама композиция повести, как бы обрамленной образом огня в двух противоположных его проявлениях на первой и последних ее страницах.
   Советским читателям не довелось еще прочесть одну из последних (1962) повестей Бредбери «Недобрый гость» (Something Wicked This Way Comes), одним из эпиграфов к которой стоит строка из английского поэта Йитса - «Человек влюблен, ему дорого то, что уходит». Казалось бы, и название повести, и эпиграф подчеркивают безысходность судьбы, тоску по прошлому, и только. Однако, закрыв прочитанную повесть, обнаруживаешь, что след, оставленный ею в сознании, необычайно светел, и так же крепка вера в то, что два подростка- герои книги Джим и Уилл, стоящие на пороге юности,- унесут с собой в жизнь твердую готовность противостоять подстерегавшей их на протяжении всей повести угрозе темных и злых сил. Запоминается и облик отца одного из этих мальчишек - библиотекаря Чарльза Уильяма Халлоуэя, преданного хранителя интеллектуальных ценностей, воплощающего в себе силу человеческого духа. И это - несмотря на гнетущую атмосферу ужаса, которую приносят в город на страх мальчишкам безобразные и таинственные маскии монстры бродячего цирка. Тем сильнее ликуешь вместе с героями повести, когда доброе начало одерживает победу над символами Зла.
   В одном из недавних интервью Рэй Бредбери бросил такие слова: «Если когда-нибудь после моей смерти мою могилу посетит мальчик и скажет: «Здесь лежит рассказчик приключений»,- я буду счастлив». Было бы ошибочно принять это замечание всего лишь за стремление овладеть мастерством рассказчика-развлекателя. В этой выразительной реплике есть и другая сторона - мечта о том, чтобы и в будущем не исчезли на Земле мечтатели, романтики, которым очень нужны те самые рассказы о приключениях, которые уносили бы их в мир, далекий от материальных устремлений, и помогали бы им оставаться людьми и строить светлую человеческую жизнь.
   Сам Рэй Бредбери вносит заметный вклад в борьбу именно за такого'''

print(*_get_part_text(text5, 187, 500), sep='\n')
num = text5.count('   ')
print(num)

# Функция, формирующая словарь книги
def prepare_book(path: str) -> None:
    pass

# Вызов функции prepare_book для подготовки книги из текстового файла
prepare_book(os.path.join(sys.path[0], os.path.normpath(BOOK_PATH)))
# print('hier',  os.path.normpath(BOOK_PATH))
# print('hier',  sys.path[0])
# print('hier',  os.path)